app/Controllers/TDB_PEMESAN_CTRL.php

SELECT *
FROM `tdb_pemesan`
---
    public function index()
    {
        $vardatapemesan = $this->DATAPEMESAN->FindAll();